/**/
"Cancel" = "Отмена";
/**/
"Delete" = "Удалить";
/**/
"Open" = "Открыть";
/**/
"Edit" = "Редактировать";
/**/
"Yes" = "Да";
/**/
"Finish" = "Завершить";
/**/
"Done" = "Готово";
/**/
"Save" = "Сохранить";
/**/
"Undo" = "Отменить";
/**/
"Redo" = "Повторить";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Да - Удалить";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Применить геометрию";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Очистить геометрию";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Удалить вершину";
/*Geometry Edit Action Name*/
"Insert Part" = "Вставить сегмент";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Добавить вершину";
/*Geometry Edit Action Name*/
"Move Vertex" = "Переместить вершину";
/*Geometry Edit Action Name*/
"Remove Part" = "Удалить часть";

/*Collecting attachments*/
"Add" = "Добавить";
/*Collecting attachments*/
"Take Photo or Video" = "Снять фото или видео";
/*Collecting attachments*/
"Choose From Library" = "Выбрать из библиотеки";
/*Collecting attachments*/
"Photo" = "Фото";
/*Collecting attachments*/
"Video" = "Видео";
/*Collecting attachments*/
"Save To Photo Library" = "Сохранить изображение";
/*Collecting attachments*/
"Download" = "Загрузить";

/*Date attribute*/
"Today" = "Сегодня";

/**/
"Attachments" = "Вложения";
"Attributes" = "Атрибуты";

/**/
"Open in Safari" = "Открыть в Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Введите число в диапазоне от %i до %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Введите число от %@ до %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Слишком длинная строка (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Числовое значение выходит за допустимые пределы.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Тип поля не поддерживается";

/**/
"%d of %d" = "%d из %d";

/**/
"Changing Feature Type" = "Изменение типа объекта";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Вы хотите изменить тип объекта, что может привести к перезаписи некоторых значений полей. Вы уверены?";

/**/
"Deleting Feature" = "Удаление объекта";
"Are you sure you want to delete this feature?" = "Вы уверены, что хотите удалить этот объект?";

/**/
"Data for pie chart is invalid" = "Некорректные данные для круговой диаграммы";
"No data to create a pie chart" = "Нет данных для создания круговой диаграммы";
"No image to display" = "Нет изображений для отображения";

/**/
"Created by %@ seconds ago" = "Создано %@ несколько секунд назад";

/**/
"Created by %@ a minute ago" = "Создано %@ минуту назад";

/**/
"Edited by %@ seconds ago" = "Изменил %@ несколько секунд назад";

/**/
"Edited by %@ a minute ago" = "Изменил %@ минуту назад";

/**/
"Created seconds ago" = "Создано сек. назад";

/**/
"Created a minute ago" = "Создано 1 мин. назад";

/**/
"Edited seconds ago" = "Отредактировано сек. назад";

/**/
"Edited a minute ago" = "Отредактировано 1 мин. назад";

/**/
"Created by %@ %d minutes ago" = "Создано %@ %d мин назад";

/**/
"Created by %@ an hour ago" = "Создано %@ час назад";

/**/
"Created by %@ %d hours ago" = "Создано %@ %d ч назад";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Создано %@ %@ в %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Создано %@ %@ в %@";

/**/
"Edited by %@ %d minutes ago" = "Изменил %@ %d мин назад";

/**/
"Edited by %@ an hour ago" = "Изменил %@ час назад";

/**/
"Edited by %@ %d hours ago" = "Изменил %@ %d ч назад";

/**/
"Edited by %@ on %@ at %@ - day" = "Изменил %@ %@ в %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Изменил %@ %@ в %@";

/**/
"Created by %@" = "Создано %@";

/**/
"Edited by %@" = "Изменил %@";

/**/
"Created %d minutes ago" = "Создано %d мин назад";

/**/
"Created an hour ago" = "Создано 1 час назад";

/**/
"Created %d hours ago" = "Создано %d ч назад";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Создано %@ в %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Создано %@ в %@";

/**/
"Edited %d minutes ago" = "Изменено %d мин назад";

/**/
"Edited an hour ago" = "Изменено час назад";

/**/
"Edited %d hours ago" = "Изменено %d ч назад";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Изменено %@ в %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Изменено %@ в %@";

/* Used to denote a required field */
"Required" = "Обязательно";

/* Used for naming layers with no names */
"Layer %d" = "Слой %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Не удалось найти адрес местоположения";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Не удалось найти местоположение адреса";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Не удалось считать адрес";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Файл не найден";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Не удалось найти локатор";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Внутренняя ошибка локатора";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Геокодирование перекрестков не поддерживается локатором";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Недопустимые свойства локатора";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Отсутствует обязательное поле";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Локатор не инициализирован";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Неподдерживаемый формат локатора";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Неподдерживаемое преобразование проекции";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Неподдерживаемая пространственная привязка";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Обратное геокодирование этим локатором не поддерживается.";

/* Network analyst errors */
"Cannot open network." = "Не удалось открыть сеть.";
"Cannot retrieve route task parameters." = "Не удалось получить параметры задачи маршрутизации.";
"Insufficient number of stops." = "Недостаточное число остановок.";
"Stop (%@) was not located." = "Остановка (%@) не найдена.";
"Stop (%@) is located on a non traversable element." = "Остановка (%@) расположена на недоступном элементе.";
"Stop (%@) is located on a soft restricted element." = "Остановка (%@) расположена на программно запрещенном элементе.";
"Point barrier (%@) was not located." = "Точечный барьер (%@) не обнаружен.";
"Point barrier (%@) has invalid added cost attribute name." = "Точечный барьер (%@) имеет недопустимое имя атрибута добавленной стоимости.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Линейный барьер (%@) имеет недопустимое имя атрибута масштабируемой стоимости.";
"Line barrier (%@) does not cover any network elements." = "Линейный барьер (%@) не заходит на элементы сети.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Полигональный барьер (%@) имеет недопустимое имя атрибута масштабируемой стоимости.";
"Polygon barrier (%@) does not cover any network elements." = "Полигональный барьер (%@) не заходит на элементы сети.";
"'%@' is an invalid impedance attribute." = "'%@' не является допустимым атрибутом сопротивления.";
"'%@' restriction attribute is invalid." = "'%@' не является допустимым атрибутом ограничения.";
"'%@' accumulate attribute is invalid." = "'%@' не является допустимым атрибутом накопления.";
"'%@' is an invalid directions time attribute." = "'%@' не является допустимым атрибутом времени путевого листа.";
"Directions distance attribute is invalid." = "Недопустимый атрибут расстояния маршрутов.";
"Invalid attribute parameter attribute name (%@)." = "Некорректный атрибутивный параметр Имя атрибута (%@).";
"Invalid attribute parameter parameter name (%@)." = "Некорректный атрибутивный параметр Имя параметра (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Некорректный тип значения для атрибута (%1$@) параметра (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Некорректное ограничение использования значения для атрибута (%1$@) параметра (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Нейтральное ограничение использования значения для атрибута (%1$@) параметра (%2$@).";
"Soft restricted element (%@) was traversed." = "Маршрут построен через программно запрещенный элемент (%@).";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Сеть не содержит атрибута иерархии для выполнения иерархического планирования маршрутов.";
"No path can be found between a given pair of stops (%@)." = "Не удалось найти маршрут между данной парой точек (%@).";
"The input spatial reference is undefined." = "Входная пространственная привязка не определена.";
"The output spatial reference is undefined." = "Выходная пространственная привязка не определена.";
"The directions style is invalid." = "Недопустимый стиль маршрута.";
"The directions language is invalid." = "Недопустимый язык маршрута.";
"Directions time and distance attributes do not match." = "Атрибуты времени и расстояния в маршруте не совпадают.";
"The directions road class attribute is invalid." = "Некорректный атрибут класса дорог в маршруте.";
"Unknown condition." = "Неизвестное состояние.";
"Invalid route task parameters." = "Недопустимые параметры задачи маршрутизации.";
"Route task's solution cannot be found." = "Задача построения маршрута не найдена.";
"Route task was cancelled." = "Задача маршрутизации отменена.";
"Route task internal error." = "Внутренняя ошибка задачи маршрутизации.";
"Route name property is not supported for local route task." = "Свойство Имя маршрута не поддерживается для задачи построения локального маршрута.";
"Local route task parameters should be retrieved from route task." = "Параметры задачи локального маршрута должны быть получены из задачи маршрута.";
"Cannot retrieve network description." = "Не удалось получить описание сети.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Для impedanceAttributeName и accumulateAttributeNames можно задать только атрибут длины.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Для impedanceAttributeName и accumulateAttributeNames можно задать только атрибут времени.";
"Service not supported." = "Сервис не поддерживается.";
"Specified start time occurs before January 1, 1970." = "Указано время начала до 1 января 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Время начала для остановки (%@) ранее 1 января 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Остановка (%@) имеет локальное временное окно, начинающееся до 1 января 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Остановка (%@) имеет временное окно UTC, начинающееся до 1 января 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "Окончание временного окна у остановки (%@) ранее его начала.";

/* Unit Abbreviated strings */
"cm" = "см";
"dd" = "дг";
"dm" = "дм";
"ft" = "фт";
"in" = "дюйм";
"km" = "км";
"m" = "м";
"mi" = "М";
"mm" = "мм";
"nm" = "ММ";
"pt" = "тчк";
"Unknown" = "Неизвестные";
"yd" = "яр.";

/* Unit Display Strings */
"Centimeters" = "Сантиметры";
"Decimal Degrees" = "Десятичные градусы";
"Decimeters" = "дециметры";
"Feet" = "Футы";
"Inches" = "Дюймы";
"Kilometers" = "Километры";
"Meters" = "Метры";
"Miles" = "Мили";
"Millimeters" = "миллиметры";
"Nautical Miles" = "Морские мили";
"Points" = "Точки";
"Yards" = "Ярды";

/* Area Units Abbreviated Strings */
"sq. in" = "кв.дюйм";
"sq. ft" = "кв.фут";
"sq. yd" = "кв.ярд";
"ac" = "ак.";
"sq. mi" = "кв.М";
"sq. mm" = "кв.ММ";
"sq. cm" = "кв.см";
"sq. dm" = "кв.дм";
"sq. m" = "кв.м";
"ares" = "аров";
"ha" = "га";
"sq. km" = "кв.км";

/* Area Units Display Strings */
"Square Inches" = "Квадратные дюймы";
"Square Feet" = "Квадратные футы";
"Square Yards" = "Квадратные ярды";
"Acres" = "Акры";
"Square Miles" = "Квадратные мили";
"Square Millimeters" = "Квадратные миллиметры";
"Square Centimeters" = "Квадратные сантиметры";
"Square Decimeters" = "Квадратные дециметры";
"Square Meters" = "Квадратные метры";
"Ares" = "аров";
"Hectares" = "Гектары";
"Square Kilometers" = "Квадратные километры";

/* Errors */
"Error" = "Ошибка";
"Class not @protocol AGSCoding compliant" = "Класс не совместим с @protocol AGSCoding";
"Authorization required" = "Требуется авторизация";
"Token is invalid or has expired" = "Токен неверный или истек срок его действия";
"Unknown error occurred" = "Неизвестная ошибка";
"Empty username/password" = "Поля имя пользователя/пароль пустые";
"Token URL is nil. You must set a valid token URL on the credential." = "URL-адрес токена отсутствует. Необходимо задать действительный URL-адрес токена для учетных данных.";
"Unknown authentication error" = "Неизвестная ошибка аутентификации";
"Error extracting identity" = "Ошибка извлечения идентификации";
"Error adding identity to the keychain" = "Ошибка при добавлении идентификации в цепь";
"Invalid Credentials" = "Неверные учетные данные";
"Bad URL." = "Неверный URL-адрес.";
"The feature layer does not expose an object-id field." = "Слой объектов не показывает поле идентификации объекта.";
"Both geodatabase and syncParams are required for this method." = "Для этого метода требуется указание базы геоданных и syncParams.";
"Uploading deltas is not supported with this replica." = "Загрузка дельты не поддерживается синхронизируемой базой геоданных.";
"Error creating delta geodatabase" = "Ошибка создания дельта-базы геоданных";
"Unable to create result image layer" = "Не удалось создать итоговый слой изображения";
"Cache at path '%@' not found." = "Кэш в '%@' не найден.";
"To add an item, you must be logged in to the portal." = "Чтобы добавить элемент, необходимо войти в портал.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Чтобы добавить элемент, необходимо указать значение в AGSPortalItemContentParameters.";
"The portal failed to add the item." = "Портал не может добавить элемент.";
"To delete an item, you must be logged in to the portal." = "Чтобы удалить элемент, необходимо войти в портал.";
"The portal failed to delete the item." = "Портал не может удалить элемент.";
"To update an item, an itemId and logged in user are required." = "Чтобы обновить элемент, необходимы itemId и пользователь, вошедший в систему.";
"The item failed to update." = "Не удалось обновить элемент.";
"The item failed to update JSON." = "Не удалось обновить элемент JSON.";
"You must be logged in to a portal to add a comment." = "Для добавления комментария необходимо войти в портал.";
"The comment failed to be added." = "Не удалось добавить комментарий.";
"You must be logged in to a portal to fetch the current user's rating." = "Необходимо войти в портал, чтобы увидеть текущий рейтинг пользователя.";
"You must be logged in to a portal to add a rating." = "Для добавления рейтинга необходимо войти в портал.";
"The rating failed to be added." = "Не удалось добавить рейтинг.";
"To share an item, you must be logged in to the portal." = "Чтобы предоставить доступ к элементу, необходимо войти в портал.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Чтобы отменить доступ к элементу, необходимо войти в портал и указать группы, которым будет закрыт доступ к элементу.";
"Bad Request" = "Неверный запрос";
"Credential Required" = "Требуются AGSCredential";
"Job not created" = "Задание не создано";
"Service did not return a valid URL" = "Сервис не вернул допустимый URL-адрес";
"Service did not return a file" = "Сервис не вернул файл";
"Service did not return a size" = "Сервис не вернул размер";
"Job failed" = "Сбой задания";
"Job timed out" = "Превышено время выполнения задания";
"Job was cancelled" = "Задание отменено";
"Job was deleted" = "Задание удалено";
"Feature with objectId: %d not found" = "Объект с objectId: %d не найден";
"No object-id values specified for feature table query." = "Не указаны значения object-id для запроса к таблице объектов.";
"Geodatbase at path '%@' not found." = "Отсутствует база геоданных в местоположении '%@'.";
"An error occured when creating the local Geodatabase" = "В процессе создания локальной базы геоданных произошла ошибка";
"Operation not supported for Geodatabase Feature Service Table" = "Операция на поддерживается для таблиц сервиса объектов базы геоданных";

/* OAuth */
"The specified clientID is invalid" = "Указан недопустимый clientID";
"Log In" = "Вход";

/* Sync */
"Upload is not supported with this service." = "Загрузка этим сервисом не поддерживается.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Для синхронизации необходимо задать направление, отличное от AGSGDBSyncDirectionNone.";